Revit 2024 API
StructuralSettings.SetValuesForLoadsDisplayScaling Method
 Sets values for loads display scaling by providing two load forces and their corresponding length of the representative lines in internal units.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void SetValuesForLoadsDisplayScaling(
	double minimumLoadValue,
	double minimumForceLineLength,
	double maximumLoadValue,
	double maximumForceLineLength
)
Visual Basic
Public Sub SetValuesForLoadsDisplayScaling ( _
	minimumLoadValue As Double, _
	minimumForceLineLength As Double, _
	maximumLoadValue As Double, _
	maximumForceLineLength As Double _
)
Visual C++
public:
void SetValuesForLoadsDisplayScaling(
	double minimumLoadValue,
	double minimumForceLineLength,
	double maximumLoadValue,
	double maximumForceLineLength
)
Parameters
minimumLoadValue
Type: System.Double
 The minimum force in SpecTypeId.Force units.
minimumForceLineLength
Type: System.Double
 The line length for minimum force.
maximumLoadValue
Type: System.Double
 The maximum force in SpecTypeId.Force units.
maximumForceLineLength
Type: System.Double
 The line length for maximum force.
Remarks
 Use UnitUtils class methods to convert value from or to internal units. The values are used to scale the representation of all load types(point, line and area loads).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  Thrown when: - forces are negative. - line lengths are negative. - minimum force is greater or equal to the maximum force. - line length for minimum force is greater than line length for maximum force.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace